# Introduction to dplyr and tidyr (part 1)

### Why use R?


- Save and rerun code
- Lots of stats/data science packages
- Great graphics
- Built for data
- free, open source, cross-platform
- Large community

### Market-share

![](img/Fig-1a-IndeedJobs-2017.png)

What is the `tidyverse`?
========================================================

- Multiple packages for managing and manipulating data, using data verb syntax
    - `dplyr`
        - filter
        - mutate
        - aggregate
    - `tidyr`
        - stack and unstack (`gather()` and `spread()`)
    - `ggplot`
        - Nice graphics

### Loading a Library

In [4]:
# This loads all of the dplyr functions
#must do everytime you start new R session
library("dplyr")

#### Reading in data

In [5]:
surveys <- read.csv('https://github.com/WSU-DataScience/DSCI_210_R_notebooks/raw/main/portal_data_joined.csv')
head(surveys)

  record_id month day year plot_id species_id sex hindfoot_length weight
1   1        7    16  1977 2       NL         M   32              NA
2  72        8    19  1977 2       NL         M   31              NA
3 224        9    13  1977 2       NL             NA              NA
4 266       10    16  1977 2       NL             NA              NA
5 349       11    12  1977 2       NL             NA              NA
6 363       11    12  1977 2       NL             NA              NA
  genus   species  taxa   plot_type
1 Neotoma albigula Rodent Control
2 Neotoma albigula Rodent Control
3 Neotoma albigula Rodent Control
4 Neotoma albigula Rodent Control
5 Neotoma albigula Rodent Control
6 Neotoma albigula Rodent Control

Selecting columns with `select`
========================================================

In [6]:
# Syntax: select(df, col1, col2, ...)
new_df <- select(surveys, plot_id, species_id, weight)

In [7]:
# Good habit: Always inspect the result with head
head(new_df)

  plot_id species_id weight
1 2       NL         NA
2 2       NL         NA
3 2       NL         NA
4 2       NL         NA
5 2       NL         NA
6 2       NL         NA

Filtering rows with `filter`
========================================================

Why are there columns not selected (last slide) still here?

In [8]:
new_df2 <- filter(surveys, year == 1995)
head(new_df2)

  record_id month day year plot_id species_id sex hindfoot_length weight
1 22314      6     7  1995 2       NL         M   34               NA
2 22728      9    23  1995 2       NL         F   32              165
3 22899     10    28  1995 2       NL         F   32              171
4 23032     12     2  1995 2       NL         F   33               NA
5 22003      1    11  1995 2       DM         M   37               41
6 22042      2     4  1995 2       DM         F   36               45
  genus     species  taxa   plot_type
1 Neotoma   albigula Rodent Control
2 Neotoma   albigula Rodent Control
3 Neotoma   albigula Rodent Control
4 Neotoma   albigula Rodent Control
5 Dipodomys merriami Rodent Control
6 Dipodomys merriami Rodent Control

Making a new column with `mutate`
========================================================

In [9]:
new_df <- select(surveys, plot_id, species_id, weight, year)
new_df2 <- filter(new_df, year == 1995)
new_df3 <- mutate(new_df2, weight_kg = weight / 1000)
head(new_df3)

  plot_id species_id weight year weight_kg
1 2       NL          NA    1995    NA
2 2       NL         165    1995 0.165
3 2       NL         171    1995 0.171
4 2       NL          NA    1995    NA
5 2       DM          41    1995 0.041
6 2       DM          45    1995 0.045

In [10]:
#Drop old weight column:
new_df4 <- select(new_df3, -weight)
head(new_df4)

  plot_id species_id year weight_kg
1 2       NL         1995    NA
2 2       NL         1995 0.165
3 2       NL         1995 0.171
4 2       NL         1995    NA
5 2       DM         1995 0.041
6 2       DM         1995 0.045

Motivating pipes
========================================================

### Imperative pattern - Save, save, save


<img width="450" src="img/imperative_pattern.png">

- **Problem 1:** Lots of temporary variables 
- **Problem 2:** Messy and lots of *overhead* 
    - All the extra *stuff* clouds the meaning/intent of the code

### Poor solution - Rewrite to the same data frame

```{R}
surveys <- select(surveys, plot_id, species_id, weight, year)
surveys <- filter(surveys, year == 1995)
surveys <- mutate(surveys, weight_kg = weight / 1000)
```

**Question:** What's the problems with this approach?

### Use a pipe for cleaner code

Pipe pushes the data frame through the first position:

<img width="350" src="img/pipe1.png">

### Imagine an invisible data frame in the first spot...

Important Point - Each data frame is NEW

<img width="350" src="img/pipe2.png">

### ... but don't write it!

In [11]:
surveys  %>% 
  select(plot_id, species_id, weight, year) %>%
  filter(year == 1995) %>%
  mutate(weight_kg = weight / 1000) %>%
  head()

  plot_id species_id weight year weight_kg
1 2       NL          NA    1995    NA
2 2       NL         165    1995 0.165
3 2       NL         171    1995 0.171
4 2       NL          NA    1995    NA
5 2       DM          41    1995 0.041
6 2       DM          45    1995 0.045

### My preferred code format

In [13]:
(surveys  
 %>% select(plot_id, species_id, weight, year) 
 %>% filter(year == 1995) 
 %>% mutate(weight_kg = weight / 1000) 
 %>% head()
 )

  plot_id species_id weight year weight_kg
1 2       NL          NA    1995    NA
2 2       NL         165    1995 0.165
3 2       NL         171    1995 0.171
4 2       NL          NA    1995    NA
5 2       DM          41    1995 0.041
6 2       DM          45    1995 0.045

## <font color="red"> Exercise 2 </font>

Write a pipe to perform the following tasks.

1. Compute the a weight of all species in lbs.
2. Compute the a weight of all species in lbs for each `genus`

In [ ]:
# Your code for task 1 here

In [14]:
# Your code for task 2 here

# Part 2 - Converting code and types of errors.

### You've seen piping before...
 
<img width="850" src="img/openrefine_piping.png">

### Saving the result of a piped operation

In [24]:
surveys_small <- surveys %>%
  filter(weight < 5) %>%
  select(species_id, sex, weight)

head(surveys_small)

  species_id sex weight
1 PF         F   4
2 PF         F   4
3 PF         M   4
4 RM         F   4
5 RM         M   4
6 PF             4

### The advantages of piping

* reads left-to-right
* reads top-to-bottom
* Focuses on verbs
* Removes pointless nouns

### Compare

* Imperative
* Functional
* Piping

### Imperative:

In [27]:
x <- pi
r_x <- round(x, 2)
c_x <- as.character(r_x)
c_x

[1] "3.14"

### Functional:

In [28]:
as.character(round(pi, 2))

[1] "3.14"

### Piping:

In [27]:
pi %>%
  round(2) %>%
  as.character

[1] "3.14"

## Example 1 - Converting to pipes

In [32]:
surveys_small <- filter(surveys, weight < 5) 
survey_small_id_sex_wgt <- select(surveys_small, species_id, sex, weight)
head(survey_small_id_sex_wgt)

  species_id sex weight
1 PF         F   4
2 PF         F   4
3 PF         M   4
4 RM         F   4
5 RM         M   4
6 PF             4

In [30]:
# Convert to piped code

## Example 2 - Converting to imperative

In [33]:
surveys_small <- surveys %>%
  filter(species_id == 'NL') %>%
  select(species_id, sex, weight)

head(surveys_small)

  species_id sex weight
1 NL         M   NA
2 NL         M   NA
3 NL             NA
4 NL             NA
5 NL             NA
6 NL             NA

In [29]:
# Convert to imperative

## Example 3 - Converting to functional

In [28]:
surveys_small <- surveys %>%
  filter(weight < 5) %>%
  select(species_id, sex, weight)

head(surveys_small)

  species_id sex weight
1 PF         F   4
2 PF         F   4
3 PF         M   4
4 RM         F   4
5 RM         M   4
6 PF             4

In [29]:
# Convert to imperative

## <font color="red"> Exercise 2 </font>

Perform each of the following code conversions.

In [16]:
sales <- read.csv('https://github.com/WSU-DataScience/DSCI_210_R_notebooks/raw/main/auto_sales.csv')
head(sales)

  Salesperson Compact Sedan SUV Truck
1 Ann         22      18    15  12
2 Bob         19      12    17  20
3 Yolanda     19       8    32  15
4 Xerxes      12      23    18   9

#### <font color="red">TASK 1</font>. Convert the following *piped code* to the *imperative style*

In [22]:
sales %>%
    select(Salesperson, Compact, Sedan) %>%
    mutate(Car = Compact + Sedan)

  Salesperson Compact Sedan Car
1 Ann         22      18    40
2 Bob         19      12    31
3 Yolanda     19       8    27
4 Xerxes      12      23    35

In [23]:
# Your code here

#### <font color="red">TASK 2</font>. Convert the following *imperative code* to the *piped style*

In [26]:
df2 <- mutate(sales, Car = Compact + Sedan)
df3 <- mutate(df2, Utility = SUV + Truck)
df4 <- select(df3, Salesperson, Car, Utility)
head(df4)

  Salesperson Car Utility
1 Ann         40  27
2 Bob         31  37
3 Yolanda     27  47
4 Xerxes      35  27

In [23]:
# Your code here

Types of programming errors
========================================================

* Name errors
* Syntax errors
* Semantic errors (hardest/worst)

### Name Errors - Using the wrong name

In [16]:
sales <- read.csv('https://github.com/WSU-DataScience/DSCI_210_R_notebooks/raw/main/auto_sales.csv')
head(sales)

  Salesperson Compact Sedan SUV Truck
1 Ann         22      18    15  12
2 Bob         19      12    17  20
3 Yolanda     19       8    32  15
4 Xerxes      12      23    18   9

##  Find the name errors

In [ ]:
sales %>%
  select(salesperson, sedan)

### Syntax errors - Incorrect syntax

In [35]:
head(sales

ERROR: Error in parse(text = x, srcfile = src): <text>:2:0: unexpected end of input
1: head(sales
   ^

##  Find the syntax errors

In [39]:
# Find the syntax error
sales %>%
  mutate(monthly_sedan = Sedan/3,
         monthly_suv = SUV/3
         monthly_truck = Truck/3

ERROR: Error in parse(text = x, srcfile = src): <text>:4:10: unexpected symbol
3:          monthly_suv = SUV/3
4:          monthly_truck
            ^

### Semantic Errors - Correct code, wrong meaning

In [37]:
# Find the semantic errors
sales %>%
  group_by(Salesperson) %>%
  mutate(avg_sedan = median(Truck))

  Salesperson Compact Sedan SUV Truck avg_sedan
1 Ann         22      18    15  12    12
2 Bob         19      12    17  20    20
3 Yolanda     19       8    32  15    15
4 Xerxes      12      23    18   9     9

## <font color="red"> Exercise 3 </font>

Identify all of the errors and classify each as either a name, syntax, or semantic error.

In [41]:
sales %>%
    mutate(Car = compact + sedan) %>%
    mutate(Utility = SUV * Truck %>%

ERROR: Error in parse(text = x, srcfile = src): <text>:4:0: unexpected end of input
2:     mutate(Car = compact + sedan) %>%
3:     mutate(Utility = SUV * Truck %>%
  ^

> Your answer here